# -*- mode: org; coding: utf-8 -*-
#+TITLE: SICP Chapter Two
#+STARTUP: overview

** 2.5
*Exercise 2.5:* Show that we can represent pairs of nonnegative
integers using only numbers and arithmetic operations if we
represent the pair a and b as the integer that is the product 2^a
3^b.  Give the corresponding definitions of the procedures `cons',
`car', and `cdr'.
#+begin_src scheme :results output
(define (cons x y)
  (* (expt 2 x) (expt 3 y)))
(define (car z)
  (if (= (modulo z 2) 0)
      (1+ (car (/ z 2)))
      0))
(define (cdr z)
  (if (= (modulo z 3) 0)
      (1+ (cdr (/ z 3)))
      0))
(display (car (cons 4 12)))
(newline)
(display (cdr (cons 4 12)))

#+end_src

#+RESULTS:
: 4
: 12

** 2.17
*Exercise 2.17:* Define a procedure `last-pair' that returns the
list that contains only the last element of a given (nonempty)
list:
    (last-pair (list 23 72 149 34))
    (34)
#+begin_src scheme
(define (last-pari l)
  (cond (((null? l) (error "l is not a list"))
         ((null? (cdr l)) (car l))
         (#t (last-pair (cdr l))))))
(define t (cons 1 (cons 2 '())))
(last-pair t)
#+end_src

#+RESULTS:
| 2 |
** 2.19
*Exercise 2.19:* Consider the change-counting program of section
*Note 1-2-2::.  It would be nice to be able to easily change the
currency used by the program, so that we could compute the number
of ways to change a British pound, for example.  As the program is
written, the knowledge of the currency is distributed partly into
the procedure `first-denomination' and partly into the procedure
`count-change' (which knows that there are five kinds of U.S.
coins).  It would be nicer to be able to supply a list of coins to
be used for making change.

We want to rewrite the procedure `cc' so that its second argument
is a list of the values of the coins to use rather than an integer
specifying which coins to use.  We could then have lists that
defined each kind of currency:

(define us-coins (list 50 25 10 5 1))

(define uk-coins (list 100 50 20 10 5 2 1 0.5))

We could then call `cc' as follows:

(cc 100 us-coins)
292

To do this will require changing the program `cc' somewhat.  It
will still have the same form, but it will access its second
argument differently, as follows:

(define (cc amount coin-values)
(cond ((= amount 0) 1)
        ((or (< amount 0) (no-more? coin-values)) 0)
        (else
        (+ (cc amount
                (except-first-denomination coin-values))
            (cc (- amount
                    (first-denomination coin-values))
                coin-values)))))

Define the procedures `first-denomination',
`except-first-denomination', and `no-more?' in terms of primitive
operations on list structures.  Does the order of the list
`coin-values' affect the answer produced by `cc'?  Why or why not?
#+begin_src scheme
(define (cc amount coin-values)
(cond ((= amount 0) 1)
    ((or (< amount 0) (no-more? coin-values)) 0)
    (else
        (+ (cc amount
            (except-first-denomination coin-values))
        (cc (- amount
                (first-denomination coin-values))
            coin-values)))))
(define (first-denomination coin-values)
(car coin-values))
(define (except-first-denomination coin-values)
(cdr coin-values))
(define (no-more? coin-values)
(null? coin-values))

(cc 100 '(1 5 10 25 50))
#+end_src

#+RESULTS:
: 292
** 2.20
    *Exercise 2.20:* The procedures `+', `*', and `list' take
    arbitrary numbers of arguments. One way to define such procedures
    is to use `define' with notation "dotted-tail notation".  In a
    procedure definition, a parameter list that has a dot before the
    last parameter name indicates that, when the procedure is called,
    the initial parameters (if any) will have as values the initial
    arguments, as usual, but the final parameter's value will be a "list"
    of any remaining arguments.  For instance, given the definition

        (define (f x y . z) <BODY>)

    the procedure `f' can be called with two or more arguments.  If we
    evaluate

        (f 1 2 3 4 5 6)

    then in the body of `f', `x' will be 1, `y' will be 2, and `z'
    will be the list `(3 4 5 6)'.  Given the definition

        (define (g . w) <BODY>)

    the procedure `g' can be called with zero or more arguments.  If we
    evaluate

        (g 1 2 3 4 5 6)

    then in the body of `g', `w' will be the list `(1 2 3 4 5 6)'.(4)

    Use this notation to write a procedure `same-parity' that takes
    one or more integers and returns a list of all the arguments that
    have the same even-odd parity as the first argument.  For example,

        (same-parity 1 2 3 4 5 6 7)
        (1 3 5 7)

        (same-parity 2 3 4 5 6 7)
        (2 4 6)

#+begin_src scheme :results output
(define (same-parity a . w)
  (define (handle w rv)
    (cond ((null? w) rv)
           ((= (modulo a 2) (modulo (car w) 2)) (handle (cdr w) (cons (car w) rv)))
           (#t (handle (cdr w) rv))))
  (reverse (handle (cons a w) '())))

(display (same-parity 1 2 3 4 5 6 7 8 9))
#+end_src

#+RESULTS:
: (1 3 5 7 9)
** 2.27
*Exercise 2.27:* Modify your `reverse' procedure of *Note Exercise
2-18:: to produce a `deep-reverse' procedure that takes a list as
argument and returns as its value the list with its elements
reversed and with all sublists deep-reversed as well.  For example,

    (define x (list (list 1 2) (list 3 4)))

    x
    ((1 2) (3 4))

    (reverse x)
    ((3 4) (1 2))

    (deep-reverse x)
    ((4 3) (2 1))
#+begin_src scheme :results output
(define x (list (list 1 2) (list 3 4)))

(define (reverse l)
  (define (reverse_iter l rv)
    (cond ((null? l) rv)
          ((not (pair? (car l))) (reverse_iter (cdr l) (cons (car l) rv)))
          (else (reverse_iter (cdr l) (cons (reverse_iter (car l) #nil) rv)))))
  (reverse_iter l #nil))

(display  (reverse x))


#+end_src

#+RESULTS:
: ((4 3) (2 1))

** 2.28
*Exercise 2.28:* Write a procedure `fringe' that takes as argument
a tree (represented as a list) and returns a list whose elements
are all the leaves of the tree arranged in left-to-right order.
For example,

    (define x (list (list 1 2) (list 3 4)))

    (fringe x)
    (1 2 3 4)

    (fringe (list x x))
    (1 2 3 4 1 2 3 4)

#+begin_src scheme :results raw
(define x (list (list 1 2) (list 3 4)))

(define (fringe x)
  (cond (
         (null? x) #nil)
        ((pair? (car x)) (append (fringe (car x)) (fringe (cdr x))))
        (else (cons (car x) (fringe (cdr x))))))
(fringe x)
#+end_src

#+RESULTS:
(1 2 3 4)
** 2.29
*Exercise 2.29:* A binary mobile consists of two branches, a left
branch and a right branch.  Each branch is a rod of a certain
length, from which hangs either a weight or another binary mobile.
We can represent a binary mobile using compound data by
constructing it from two branches (for example, using `list'):

    (define (make-mobile left right)
    (list left right))

A branch is constructed from a `length' (which must be a number)
together with a `structure', which may be either a number
(representing a simple weight) or another mobile:

    (define (make-branch length structure)
    (list length structure))

a. Write the corresponding selectors `left-branch' and
    `right-branch', which return the branches of a mobile, and
    `branch-length' and `branch-structure', which return the
    components of a branch.
#+begin_src scheme :session mobile
(define (left-branch m)
  (car m))
(define (right-branch m)
  (cadr m))

(define (branch-length b)
  (car b))
(define (branch-structure b)
  (cadr b))
#+end_src

b. Using your selectors, define a procedure `total-weight' that
    returns the total weight of a mobile.
#+begin_src scheme :session mobile
(define mobile '((1 ((1 3) (2 4))) (1 3)))

(define (total-weight m)
  (let* ((left (branch-structure (left-branch m)))
         (right (branch-structure (right-branch m)))
         (left-weight (if (pair? left) (total-weight left) left))
         (right-weight (if (pair? right) (total-weight right) right)))
    (+ right-weight left-weight)))

(total-weight mobile)
#+end_src

#+RESULTS:
: 10

c. A mobile is said to be "balanced" if the torque applied by
    its top-left branch is equal to that applied by its top-right
    branch (that is, if the length of the left rod multiplied by
    the weight hanging from that rod is equal to the
    corresponding product for the right side) and if each of the
    submobiles hanging off its branches is balanced. Design a
    predicate that tests whether a binary mobile is balanced.
#+begin_src scheme :session mobile
(define (mobile-balance? m)
  (let* ((left (left-branch m))
         (right (right-branch m))
         (left-balance (if (pair? (branch-structure left))
                           (mobile-balance? (branch-structure left))
                           #t))
         (right-balance (if (pair? (branch-structure right))
                            (mobile-balance? (branch-structure right))
                            #t))
         (left-product (* (branch-length left)
                          (if (pair? (branch-structure left))
                              (total-weight (branch-structure left))
                              (branch-structure left))))
         (right-product (* (branch-length right)
                           (if (pair? (branch-structure right))
                               (total-weight (branch-structure right))
                               (branch-structure right)))))
    (and left-balance right-balance (= left-product right-product))))

(mobile-balance? mobile)
#+end_src

d. Suppose we change the representation of mobiles so that the constructors are
        (define (make-mobile left right)
            (cons left right))

        (define (make-branch length structure)
            (cons length structure))

    How much do you need to change your programs to convert to
    the new representation?
** 2.30
*Exercise 2.30:* Define a procedure `square-tree' analogous to the
`square-list' procedure of *Note Exercise 2-21::.  That is,
`square-list' should behave as follows:

    (square-tree
    (list 1
            (list 2 (list 3 4) 5)
            (list 6 7)))
    (1 (4 (9 16) 25) (36 49))

Define `square-tree' both directly (i.e., without using any
higher-order procedures) and also by using `map' and recursion.
#+begin_src scheme :results raw
(define (square-tree tree)
  (map (lambda (sub)
         (if (pair? sub)
             (square-tree sub)
             (* sub sub))) tree))

(square-tree
 (list 1
       (list 2 (list 3 4) 5)
       (list 6 7)))
#+end_src

#+RESULTS:
(1 (4 (9 16) 25) (36 49))
** 2.32
*Exercise 2.32:* We can represent a set as a list of distinct
elements, and we can represent the set of all subsets of the set as
a list of lists.  For example, if the set is `(1 2 3)', then the
set of all subsets is `(() (3) (2) (2 3) (1) (1 3) (1 2) (1 2
3))'.  Complete the following definition of a procedure that
generates the set of subsets of a set and give a clear explanation
of why it works:

    (define (subsets s)
    (if (null? s)
        (list nil)
        (let ((rest (subsets (cdr s))))
            (append rest (map <??> rest)))))
#+begin_src scheme
(define (subsets s)
    (if (null? s)
        (list #nil)
        (let ((rest (subsets (cdr s))))
          (append rest (map (lambda (x) (cons (car s) x)) rest)))))

(subsets '(1 2 3))
#+end_src

#+RESULTS:
(#nil (3) (2) (2 3) (1) (1 3) (1 2) (1 2 3))
** 2.33
*Exercise 2.33:* Fill in the missing expressions to complete the
following definitions of some basic list-manipulation operations
as accumulations:

    (define (map p sequence)
    (accumulate (lambda (x y) <??>) nil sequence))

    (define (append seq1 seq2)
    (accumulate cons <??> <??>))

    (define (length sequence)
    (accumulate <??> 0 sequence))
#+begin_src scheme :results output :session accumulate
(define (accumulate op initial sequence)
       (if (null? sequence)
           initial
           (op (car sequence)
               (accumulate op initial (cdr sequence)))))

(define (map p sequence)
  (accumulate (lambda (x y) (cons (p x) y)) #nil sequence))

(define (append seq1 seq2)
  (accumulate cons seq2 seq1))

(define (length sequence)
  (accumulate (lambda (x y) (1+ y)) 0 sequence))

(display (map (lambda (x) (* x x)) '(1 2 3 4 5 6)))
(newline)
(display (append '(1 2 3) '(4 5 6)))
(newline)
(display (length '(1 2 3 4 5 6)))
#+end_src

#+RESULTS:
(1 4 9 16 25 36)
(1 2 3 4 5 6)
6

** 2.38
#+begin_src scheme :results output :session fold
(define (fold-left op initial sequence)
  (define (iter result rest)
    (if (null? rest)
        result
        (iter (op result (car rest))
              (cdr rest))))
  (iter initial sequence))

(define (fold-right op initial sequence)
  (if (null? sequence)
      initial
      (op (car sequence)
          (fold-right op initial (cdr sequence)))))

(display (fold-right / 1 (list 1 2 3 4)))
(newline)
(display (fold-left / 1 (list 1 2 3)))
(newline)
(display (fold-right list #nil (list 1 2 3)))
(newline)
(display (fold-left list #nil (list 1 2 3)))
(newline)
(display (fold-right + 0 '(1 2 3 4 5)))
(newline)
(display (fold-right + 0 '(1 2 3 4 5)))
#+end_src

#+RESULTS:
: 3/8
: 1/6
: (1 (2 (3 #nil)))
: (((#nil 1) 2) 3)
: 15
: 15
** 2.39
*Exercise 2.39:* Complete the following definitions of `reverse'
(*Note Exercise 2-18::) in terms of `fold-right' and `fold-left'
from *Note Exercise 2-38:::

    (define (reverse sequence)
    (fold-right (lambda (x y) <??>) nil sequence))

    (define (reverse sequence)
    (fold-left (lambda (x y) <??>) nil sequence))
   
#+begin_src scheme :results output :session fold
(define (reverse-r sequence)
  (fold-right (lambda (x y) (append y (list x))) '() sequence))

(define (reverse-l sequence)
  (fold-left (lambda (x y) (cons y x)) '() sequence))

(display (reverse-r '(1 2 3 4 5 6)))
(newline)
(display (reverse-l '(1 2 3 4 5 6)))

#+end_src

#+RESULTS:
: (6 5 4 3 2 1)
: (6 5 4 3 2 1)
** 2.40
*Exercise 2.40:* Define a procedure `unique-pairs' that, given an
integer n, generates the sequence of pairs (i,j) with 1 <= j< i <=
n.  Use `unique-pairs' to simplify the definition of
`prime-sum-pairs' given above.
#+begin_src scheme :session flatmap :results output
(use-srfis '(1))
(define (enumerate-interval beg end)
  (if (> beg end)
      '()
      (cons beg (enumerate-interval (1+ beg) end))))

(define (flatmap proc seq)
  (fold-right append '() (map proc seq)))

(define (unique-pairs n)
  (flatmap
   (lambda (i)
     (map (lambda (j) (list i j))
          (enumerate-interval (1+ i) n)))
   (enumerate-interval 1 (- n 1))))

(display (unique-pairs 5))
#+end_src

#+RESULTS:
: ((1 2) (1 3) (1 4) (1 5) (2 3) (2 4) (2 5) (3 4) (3 5) (4 5))

** 2.41
*Exercise 2.41:* Write a procedure to find all ordered triples of distinct
positive integers i, j, and k less than or equal to a given integer n that sum
to a given integer s.
#+begin_src scheme :session flatmap :results raw
(define (unique-triples n)
  (flatmap (lambda (i)
         (flatmap (lambda (j)
                (map (lambda (k)
                       (list i j k))
                     (enumerate-interval 1 (- j 1))))
              (enumerate-interval 2 (- i 1)))) (enumerate-interval 3 n)))

(define (triples n s)
  (filter (lambda (i) (= s (+ (car i) (cadr i) (caddr i))))
          (unique-triples n)))


(triples 10 17)
#+end_src

#+RESULTS:
((7 6 4) (8 5 4) (8 6 3) (8 7 2) (9 5 3) (9 6 2) (9 7 1) (10 4 3) (10 5 2) (10 6 1))
** 2.42
#+begin_src scheme :session flatmap :results raw
(define (safe-two x y)
  (let ((row-x (car x))
        (row-y (car y))
        (col-x (cadr x))
        (col-y (cadr y)))
    (if (= row-x row-y) #f
        (not (= (abs (/ (- col-x col-y) (- row-x row-y))) 1)))))

(define (safe? k positions)
  (let ((position (car positions))
        (rest (cdr positions)))
    ;; check whether same row
    (fold (lambda (x y) (and y (safe-two x position)) ) #t rest)))

(display (safe? 8 '((1 2) (3 3 ) (4 4))))

(define (adjoin-position new-row k rest-of-queens)
  (cons  (list new-row k) rest-of-queens))

(define empty-board '())

(define (queens board-size)
  (define (queen-cols k)
    (if (= k 0)
        (list empty-board)
        (filter
         (lambda (positions) (safe? k positions))
         (flatmap
          (lambda (rest-of-queens)
            (map (lambda (new-row)
                   (adjoin-position new-row k rest-of-queens))
                 (enumerate-interval 1 board-size)))
          (queen-cols (- k 1))))))
  (queen-cols board-size))

(length (queens 8))
#+end_src

#+RESULTS:
92
** 2.67
#+begin_src scheme :session haffman
(define (make-leaf symbol weight)
  (list 'leaf symbol weight))

(define (leaf? object)
  (eq? (car object) 'leaf))

(define (symbol-leaf x) (cadr x))

(define (weight-leaf x) (caddr x))

(define (make-code-tree left right)
  (list left
        right
        (append (symbols left) (symbols right))
        (+ (weight left) (weight right))))

(define (left-branch tree) (car tree))

(define (right-branch tree) (cadr tree))

(define (symbols tree)
  (if (leaf? tree)
      (list (symbol-leaf tree))
      (caddr tree)))

(define (weight tree)
  (if (leaf? tree)
      (weight-leaf tree)
      (cadddr tree)))

(define (decode bits tree)
  (define (decode-1 bits current-branch)
    (if (null? bits)
        '()
        (let ((next-branch
               (choose-branch (car bits) current-branch)))
          (if (leaf? next-branch)
              (cons (symbol-leaf next-branch)
                    (decode-1 (cdr bits) tree))
              (decode-1 (cdr bits) next-branch)))))
  (decode-1 bits tree))

(define (choose-branch bit branch)
  (cond ((= bit 0) (left-branch branch))
        ((= bit 1) (right-branch branch))
        (else (error "bad bit -- CHOOSE-BRANCH" bit))))

(define (adjoin-set x set)
  (cond ((null? set) (list x))
        ((< (weight x)
            (weight (car set)))
         (cons x set))
        (else
         (cons (car set)
               (adjoin-set x (cdr set))))))

(define (make-leaf-set pairs)
  (if (null? pairs)
      '()
      (let ((pair (car pairs)))
        (adjoin-set (make-leaf (car pair) ; symbol
                               (cadr pair)) ; frequency
                    (make-leaf-set (cdr pairs))))))
#+end_src

*Exercise 2.67:* Define an encoding tree and a sample message:
#+begin_src scheme :session haffman
(define sample-tree
  (make-code-tree (make-leaf 'A 4)
                  (make-code-tree
                   (make-leaf 'B 2)
                   (make-code-tree (make-leaf 'D 1)
                                   (make-leaf 'C 1)))))
(define sample-message '(0 1 1 0 0 1 0 1 0 1 1 1 0))
#+end_src

Use the `decode' procedure to decode the message, and give the result.
#+begin_src scheme :session haffman :results raw
(decode sample-message sample-tree)
#+end_src

#+RESULTS:
(A D A B B C A)
** 2.68
*Exercise 2.68:* The `encode' procedure takes as arguments a
message and a tree and produces the list of bits that gives the
encoded message.
#+begin_src scheme :session haffman
(define (encode message tree)
  (if (null? message)
      '()
      (append (encode-symbol (car message) tree)
              (encode (cdr message) tree))))
#+end_src

`Encode-symbol' is a procedure, which you must write, that returns
the list of bits that encodes a given symbol according to a given
tree.  You should design `encode-symbol' so that it signals an
error if the symbol is not in the tree at all.  Test your
procedure by encoding the result you obtained in *Note Exercise
2-67:: with the sample tree and seeing whether it is the same as
the original sample message.
#+begin_src scheme :session haffman :results raw
(define (encode-symbol c tree)
  (if (not (memq c (symbols tree)))
      (error "not in tree"))
  (if (leaf? tree)
      '()
      (let* ((left (left-branch tree))
             (right (right-branch tree))
             (left-symbols (symbols left))
             (right-symbols (symbols right)))
        (if (memq c left-symbols)
            (cons 0 (encode-symbol c left))
            (cons 1 (encode-symbol c right))))))
(encode '(A D A B B C A) sample-tree)
#+end_src

#+RESULTS:
(0 1 1 0 0 1 0 1 0 1 1 1 0)
** 2.69
*Exercise 2.69:* The following procedure takes as its argument a
list of symbol-frequency pairs (where no symbol appears in more
than one pair) and generates a Huffman encoding tree according to
the Huffman algorithm.
#+begin_src scheme :session haffman
(define (generate-huffman-tree pairs)
  (successive-merge (make-leaf-set pairs)))
#+end_src

#+RESULTS:
: #<unspecified>

`Make-leaf-set' is the procedure given above that transforms the
list of pairs into an ordered set of leaves.  `Successive-merge'
is the procedure you must write, using `make-code-tree' to
successively merge the smallest-weight elements of the set until
there is only one element left, which is the desired Huffman tree.
(This procedure is slightly tricky, but not really complicated.
If you find yourself designing a complex procedure, then you are
almost certainly doing something wrong.  You can take significant
advantage of the fact that we are using an ordered set
representation.)
#+begin_src scheme :session haffman
(define (successive-merge leafs)
  (if (null? (cdr leafs))
      (car leafs)
      (let ((first (car leafs))
            (second (cadr leafs))
            (tail (cddr leafs)))
        (successive-merge (adjoin-set (make-code-tree first second) tail)))))

 (define test-tree (generate-huffman-tree '((A 3) (B 5) (C 6) (D 6))))

 (encode '(A B C D) test-tree)
#+end_src

